app/Controllers/Artikel.php

    public function admin_index()
{
    // 1. Mengambil input dari kotak pencarian yang bernama 'cari'
    $cari = $this->request->getVar('cari');

    if ($cari) {
        // 2. Jika ada kata kunci, cari judul yang mirip
        $this->artikelModel->like('judul', $cari);
    }

    $data = [
        'title'   => 'Halaman Admin - Artikel',
        // 3. Menampilkan 5 data per halaman (ubah angka 5 jika ingin lebih banyak)
        'artikel' => $this->artikelModel->orderBy('id', 'DESC')->paginate(5, 'artikel'),
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `artikel`